In [12]:
import pandas as pd

In [13]:
data = {'Name': ['John', 'Emma', 'Tom', 'Emily', "North", "Seen"],
        'Age': [None, 28, 23, 27, 38, 38],
        'City': ['New York', 'San Francisco', 'London', 'Paris', 'BKK', 'BKK']}
df = pd.DataFrame(data)

df['Salary'] = [50000, 60000, 45000, 55000, 20000, 30000]  # Add a new column

df

    Name   Age           City  Salary
0   John   NaN       New York   50000
1   Emma  28.0  San Francisco   60000
2    Tom  23.0         London   45000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000
5   Seen  38.0            BKK   30000

In [3]:
# Dictionary
dict = df.to_dict() 
print(dict)

{'Name': {0: 'John', 1: 'Emma', 2: 'Tom', 3: 'Emily', 4: 'North', 5: 'Seen'}, 'Age': {0: nan, 1: 28.0, 2: 23.0, 3: 27.0, 4: 38.0, 5: 38.0}, 'City': {0: 'New York', 1: 'San Francisco', 2: 'London', 3: 'Paris', 4: 'BKK', 5: 'BKK'}, 'Salary': {0: 50000, 1: 60000, 2: 45000, 3: 55000, 4: 20000, 5: 30000}}

In [ ]:
# List
list = df['Salary'].to_list()
print(list)

In [5]:
# Json
json = df.to_json()
print(json)

{"Name":{"0":"John","1":"Emma","2":"Tom","3":"Emily","4":"North","5":"Seen"},"Age":{"0":null,"1":28.0,"2":23.0,"3":27.0,"4":38.0,"5":38.0},"City":{"0":"New York","1":"San Francisco","2":"London","3":"Paris","4":"BKK","5":"BKK"},"Salary":{"0":50000,"1":60000,"2":45000,"3":55000,"4":20000,"5":30000}}

In [6]:
# Html
html = df.to_html()
print(html)

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Age</th>
      <th>City</th>
      <th>Salary</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>John</td>
      <td>NaN</td>
      <td>New York</td>
      <td>50000</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Emma</td>
      <td>28.0</td>
      <td>San Francisco</td>
      <td>60000</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Tom</td>
      <td>23.0</td>
      <td>London</td>
      <td>45000</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Emily</td>
      <td>27.0</td>
      <td>Paris</td>
      <td>55000</td>
    </tr>
    <tr>
      <th>4</th>
      <td>North</td>
      <td>38.0</td>
      <td>BKK</td>
      <td>20000</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Seen</td>
      <td>38.0</td>
      <td>BKK</td>
      <td>30000</td>
    </tr>
  </tbody>
</table>

In [7]:
# Csv
df.to_csv('output.csv', index=False)

In [8]:
df.head()

    Name   Age           City  Salary
0   John   NaN       New York   50000
1   Emma  28.0  San Francisco   60000
2    Tom  23.0         London   45000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000

In [9]:
df.tail()

    Name   Age           City  Salary
1   Emma  28.0  San Francisco   60000
2    Tom  23.0         London   45000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000
5   Seen  38.0            BKK   30000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     5 non-null      float64
 2   City    6 non-null      object
 3   Salary  6 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 324.0+ bytes

In [11]:
df.describe()

            Age        Salary
count   5.00000      6.000000
mean   30.80000  43333.333333
std     6.83374  15383.974346
min    23.00000  20000.000000
25%    27.00000  33750.000000
50%    28.00000  47500.000000
75%    38.00000  53750.000000
max    38.00000  60000.000000

In [14]:
df['Name']

0     John
1     Emma
2      Tom
3    Emily
4    North
5     Seen
Name: Name, dtype: object

In [15]:
df['Age'].mean()

30.8

In [16]:
df['City'].unique()

array(['New York', 'San Francisco', 'London', 'Paris', 'BKK'],
      dtype=object)

In [17]:
df['Age'].apply(lambda x: x + 1)

0     NaN
1    29.0
2    24.0
3    28.0
4    39.0
5    39.0
Name: Age, dtype: float64

In [18]:
df['Age'] > 25

0    False
1     True
2    False
3     True
4     True
5     True
Name: Age, dtype: bool

In [19]:
df[df['Age'] > 25]

    Name   Age           City  Salary
1   Emma  28.0  San Francisco   60000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000
5   Seen  38.0            BKK   30000

In [ ]:
df[(df['Age'] > 25) & (df['City'] == 'BKK')]

In [20]:
df.query("Age > 25 and City == 'BKK'")

    Name   Age City  Salary
4  North  38.0  BKK   20000
5   Seen  38.0  BKK   30000

In [21]:
grouped_data = df.groupby('City')

In [22]:
grouped_data['Age'].mean()

City
BKK              38.0
London           23.0
New York          NaN
Paris            27.0
San Francisco    28.0
Name: Age, dtype: float64

In [23]:
grouped_data['Salary'].sum()

City
BKK              50000
London           45000
New York         50000
Paris            55000
San Francisco    60000
Name: Salary, dtype: int64

In [24]:
print(df.isnull())

    Name    Age   City  Salary
0  False   True  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False
5  False  False  False   False

In [25]:
df_dropna = df.dropna()
df_dropna

    Name   Age           City  Salary
1   Emma  28.0  San Francisco   60000
2    Tom  23.0         London   45000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000
5   Seen  38.0            BKK   30000

In [26]:
df_fillna = df.fillna(0)
df_fillna

    Name   Age           City  Salary
0   John   0.0       New York   50000
1   Emma  28.0  San Francisco   60000
2    Tom  23.0         London   45000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000
5   Seen  38.0            BKK   30000

In [27]:
df_fillna = df.fillna(df.mean(numeric_only=True))
df_fillna

    Name   Age           City  Salary
0   John  30.8       New York   50000
1   Emma  28.0  San Francisco   60000
2    Tom  23.0         London   45000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000
5   Seen  38.0            BKK   30000

In [28]:
def categorize_age(age):
    if age < 30:
        return 'Young'
    elif age < 40:
        return 'Middle-aged'
    else:
        return 'Old'

In [29]:
df['Age Category'] = df['Age'].apply(categorize_age)
df

    Name   Age           City  Salary Age Category
0   John   NaN       New York   50000          Old
1   Emma  28.0  San Francisco   60000        Young
2    Tom  23.0         London   45000        Young
3  Emily  27.0          Paris   55000        Young
4  North  38.0            BKK   20000  Middle-aged
5   Seen  38.0            BKK   30000  Middle-aged

In [ ]:
average_salary_by_city = df.groupby('City')['Salary'].mean()
average_salary_by_city

In [ ]:
df['City'] = pd.Categorical(df['City'])
df['City']

In [ ]:
grouped_data = df.groupby('City')['Salary'].mean()
grouped_data